<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 开启过滤器自动注册
    |--------------------------------------------------------------------------
    |
    | \Ymg\EloquentFilterServiceProvider 通过 Eloquent.Boot 事件注册 GlobalScope。
    | 开启后，将自动使用模型过滤器
    |
    */
    'auto_register' => true,

    /*
    |--------------------------------------------------------------------------
    | 模型过滤器路径
    |--------------------------------------------------------------------------
    |
    | 注册模型 GlobalScope 过滤器时，会根据此路径加载模型类对应名称的过滤器。如未提供，将使用
    | 模型类路径下的 Filters/
    |
    */
    'filters_path' => ''
];
